# Calculate summary statistics (mean, median,mode, standard deviation) for a dataset

In [1]:
#import libraries

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import stats

In [3]:
#Reading datasets
df = pd.read_csv("Titanic_dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
#drop the unnecesary columns
df.drop(["Name","PassengerId","Ticket","Cabin"],axis=1,inplace=True)

In [7]:
#check the duplicates
df.duplicated().sum()

111

In [8]:
#remove the duplicates
df = df.drop_duplicates()

In [9]:
# other information
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 780 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  780 non-null    int64
 1   Pclass    780 non-null    int64
 2   Sex       780 non-null    object
 3   Age       676 non-null    float64
 4   SibSp     780 non-null    int64
 5   Parch     780 non-null    int64
 6   Fare      780 non-null    float64
 7   Embarked  778 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 54.8+ KB

In [10]:
# Separating categorical columns and numerical columns
categorical_columns = df.select_dtypes(include="object")
numerical_columns = df.select_dtypes(exclude="object")

In [11]:
#mean
for col in numerical_columns.columns:
    mean= np.mean(df[col])
    print(f"Mean of {col} is :{mean:.2f}")

Mean of Survived is :0.41
Mean of Pclass is :2.25
Mean of Age is :29.81
Mean of SibSp is :0.53
Mean of Parch is :0.42
Mean of Fare is :34.83

In [12]:
#median
for col in numerical_columns.columns:
    median = np.median(df[col])
    print(f"median of {col} is :{median:.2f}")

median of Survived is :0.00
median of Pclass is :3.00
median of Age is :nan
median of SibSp is :0.00
median of Parch is :0.00
median of Fare is :15.95

In [15]:
#standard deviation
for col in numerical_columns.columns:
    std = np.std(df[col])
    print(f"Standard Deviation of {col} is :{std:.2f}")

Standard Deviation of Survived is :0.49
Standard Deviation of Pclass is :0.85
Standard Deviation of Age is :14.72
Standard Deviation of SibSp is :0.99
Standard Deviation of Parch is :0.84
Standard Deviation of Fare is :52.23

In [17]:
#mode
for col in categorical_columns.columns:
    mode = df[col].mode()
    print(f"Mode of {col} is :{mode[0]}")

Mode of Sex is :male
Mode of Embarked is :S

In [18]:
summary_stat = numerical_columns.agg(["mean","median","std"])

In [21]:
#rename the index to be more descriptive
summary_stat.index = ["Mean", "Median", "standard deviation"]

In [25]:
summary_stat = summary_stat.T

In [27]:
summary_stat = pd.DataFrame(summary_stat)

In [28]:
summary_stat

               Mean  Median  standard deviation
Survived   0.412821    0.00            0.492657
Pclass     2.246154    3.00            0.854452
Age       29.812751   28.00           14.727098
SibSp      0.525641    0.00            0.988046
Parch      0.417949    0.00            0.838536
Fare      34.829108   15.95           52.263440